# Словарь матов
bad_words = ['сосешь', 'нахуя', 'x*я', 'похуй', 'проебать', 'блядство', 'хуй', 'блядь', 'подонки', 'сучара', 'хуево',
             'ублюдок', 'ебаный', 'херня', 'отмудохать', 'дрочить', 'заебать', 'сучка', 'хуесос', 'говно', 'пидор',
             'дилдо', 'заебал', 'шлюхой', 'пидар', 'ебля', 'засосать', 'гей', 'нахуй', 'хули', 'проебаться',
             'проституток', 'хуевый', 'залупа', 'геями', 'манда', 'похуя', 'пиздец', 'обосраться', 'сука', 'сукин сын',
             'хуюл', 'похерить', 'шлюха', 'бляди', 'ебануть', 'задолбали', 'нахуйник', 'хулиган', 'пездень', 'пизда',
             'хуета', 'хуйня', 'тварь', 'ебашу', 'канал', 'пидорас', 'похер', 'жопа', 'шлюху', 'подонок', 'хулить',
             'хуеплет', 'убил', 'бомжиха', 'блять', 'проститутка', 'оказался', 'хую', 'еблан', 'хуя', 'сосу', 'члены',
             'поебать', 'ебать', 'запиздячить', 'хер']
